#+TITLE: Introduction to Algorithms in Python
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [a4paper,10pt]
#+OPTIONS: H:3
#+OPTIONS: toc:1 ^:t
*** numpy can import almost any text file easily
- suppose you have a file like this 
#+BEGIN_SRC python :var filename="files/genfromtxt_example_data.txt" :exports results :results output :noweb yes
  data='''# This file contains a bunch of point particles of varying locationg, speeds, \n# masses and charges\nX\tY\tZ\tVx\tVy\tVz\tmass\tcharge\n0\t0\t0\t0\t0\t0.1\t100.0\t0.0\n1.0\t0\t4\t0\t10.0\t0\t10.0\t-1.0\n0\t2\t0\t0.1\t0\t0.1\t1000.0\t0.0\n2\t2\t-3\t0.1\t0\t0.1\t100.0\t1.0\n# A comment line'''
  with open("files/genfromtxt_example_data.txt","w") as f:
      f.write(data)
  print(data)
#+END_SRC

#+RESULTS:
: # This file contains a bunch of point particles of varying locationg, speeds, 
: # masses and charges
: X	Y	Z	Vx	Vy	Vz	mass	charge
: 0	0	0	0	0	0.1	100.0	0.0
: 1.0	0	4	0	10.0	0	10.0	-1.0
: 0	2	0	0.1	0	0.1	1000.0	0.0
: 2	2	-3	0.1	0	0.1	100.0	1.0
: # A comment line

- you can import this with numpy easily
#+NAME: genfromtxt_example_import_importer
#+BEGIN_SRC python :results file silent :exports none :noweb yes
  import numpy
  data = numpy.genfromtxt("files/genfromtxt_example_data.txt", comments="#",
                          delimiter="\t", skip_header=3)
#+END_SRC
#+BEGIN_SRC python :tangle yes :tangle "codes/python/genfromtxt_example_import.py" :var filename="files/genfromtxt_example_data.txt" :eval never-export :results output :noweb yes
  <<genfromtxt_example_import_importer>>
  print(data)
#+END_SRC

#+RESULTS:
: [[  0.00000000e+00   0.00000000e+00   0.00000000e+00   0.00000000e+00
:     0.00000000e+00   1.00000000e-01   1.00000000e+02   0.00000000e+00]
:  [  1.00000000e+00   0.00000000e+00   4.00000000e+00   0.00000000e+00
:     1.00000000e+01   0.00000000e+00   1.00000000e+01  -1.00000000e+00]
:  [  0.00000000e+00   2.00000000e+00   0.00000000e+00   1.00000000e-01
:     0.00000000e+00   1.00000000e-01   1.00000000e+03   0.00000000e+00]
:  [  2.00000000e+00   2.00000000e+00  -3.00000000e+00   1.00000000e-01
:     0.00000000e+00   1.00000000e-01   1.00000000e+02   1.00000000e+00]]

- please see =help(numpy.genfromtxt)= for full documentation: the function is capable of ingesting almost any
  kind of textual data, even strings!
- but it is not fast, no text import ever is
- we'll later show how to plot this
*** Reading a HDF5 dataset using h5py
- HDF5 is a hierarchical data format, you can think of it as a file system of a sort, but inside the file:
  - data lives in a =dataset=, of any dimensionality and various types (integer, float, double...)
  - metadata in an =attribute=
  - there can be any number of both
  - a =group= can be used to grouped them
- =h5py= exposes datasets as dicts of {datasetname: datasetvalues} and attributes as python attributes; groups
  are also dicts where the values are the groups members (usually datasets, i.e. a dict within a dict)
- the dataset looks and feels like a numpy array, except
  - it can only be resized if declared resizable
  - is a memory mapped array (more on that in an exercise)
#+NAME: h5py_read_example_filename
#+BEGIN_SRC python :results file silent :exports none
"files/h5py_read_example_data.h5"
#+END_SRC
#+BEGIN_SRC python :results file silent :exports none :noweb yes
  import numpy
  import h5py
  '''Generate a 2x2 grid and random 3-vectors on it.'''
  YX=numpy.mgrid[-5:5:2j,-11:11:2j]
  vecs = numpy.random.random((3,)+YX[0,:,:].shape)
  f=h5py.File(<<h5py_read_example_filename>>,"w")
  f.create_dataset("my_grid_data", data=YX)
  f.create_dataset("my_vector_data", data=vecs)
  f.close()
#+END_SRC
#+BEGIN_SRC python :tangle yes :tangle "codes/python/h5py_read_example.py" :exports both :results output :noweb yes
  import h5py
  import numpy
  f=h5py.File(<<h5py_read_example_filename>>,"r")
  g = f["my_grid_data"]
  v = f["my_vector_data"]
  print("Shapes")
  print(g.shape, v.shape)
  print("Maximum of coordinate values")
  print(g[:].max())
  print("Vector norms squared")
  print(numpy.einsum('i...,i...', v, v))
#+END_SRC

#+RESULTS:
: Shapes
: (2, 2, 2) (3, 2, 2)
: Maximum of coordinate values
: 11.0
: Vector norms squared
: [[ 1.04592874  0.25349788]
:  [ 0.33607341  0.86112512]]

*** Always write huge chunks of data
- latency is more likely to ruin performance than anything else, so unless you know exactly where the I/O
  bottleneck is, do big writes into big files, even buffering internally in your code if necessary
- and big writes really means big: a 10 MB write is not a big write, let alone a big file!
- unfortunately, python is not very good at demonstrating this but you can try to compile and run this
  (available in =codes/cpp/chunk_size_effect.c=)
#+NAME: chunk_size_effect
#+BEGIN_SRC C :tangle yes :tangle "codes/cpp/chunk_size_effect.c" :padline no :cache :flags "-std=c11" :exports both :results output :cache yes
  // This file is generated by org-mode, please do not edit
  #define _GNU_SOURCE 1
  #define _POSIX_C_SOURCE 200809L
  #define _XOPEN_SOURCE 700
  #include <stdio.h>
  #include <stdlib.h>
  #include <unistd.h>
  #include <time.h>
  #include <sys/types.h>
  #include <sys/stat.h>
  #include <fcntl.h>

  #define SIZE 1000*1000*100

  int main(int argc, char *argv[]) {
    char *file1, *file2;
    if (argc != 3) {
      // please note this is UNSAFE: if such files exist, they will be overwritten
      file1 = "testfile1";
      file2 = "testfile2";
    } else {
      file1 = argv[1];
      file2 = argv[2];
    }
    int fd1 = open(file1, O_WRONLY|O_TRUNC|O_CREAT, S_IRUSR|S_IWUSR);
    int fd2 = open(file2, O_WRONLY|O_TRUNC|O_CREAT, S_IRUSR|S_IWUSR);
    double *data = (double *) calloc(SIZE, sizeof(double));
    struct timespec t1, t2, t3;
    clock_gettime(CLOCK_MONOTONIC, &t1);
    for (int i=0; i<SIZE; i++) {
      write(fd1, data+i, sizeof(double)*1);
    }
    clock_gettime(CLOCK_MONOTONIC, &t2);
    write(fd2, data, sizeof(double)*SIZE);
    clock_gettime(CLOCK_MONOTONIC, &t3);
    printf("Writing one element at a time took %6li seconds\n", t2.tv_sec-t1.tv_sec);
    printf("Writing all elements at once took  %6li seconds\n", t3.tv_sec-t2.tv_sec);
    close(fd1);
    close(fd2);
    return 0;
  }
#+END_SRC

#+RESULTS: chunk_size_effect
: Writing one element at a time took     56 seconds
: Writing all elements at once took       0 seconds

#+BEGIN_SRC sh :exports none :results output verbatim 
cat codes/cpp/chunk_size_effect.c
#+END_SRC
- Performant IO is a bit of a dark magic as there are loads of caches on the way from memory to disc and only
  the limit as file size goes to infinity will measure true IO speed
  - in the above case, my laptop gives 71 and 2 seconds, but 2 s is 4 times the theoretical maximum speed!
- Even more of a dark magic as disc, unlike the CPU, is a shared resource: other users use same discs
